src/Catalogs/СобытияПланировщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>СобытияПланировщика</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Пользователи</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Task.ЗадачаИсполнителя</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВесьДень</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаИсполнителя</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Календарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КалендариПланировщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоСобытияЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОригинальноеНачалоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОригинальноеСобытие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СобытияПланировщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторВидОкончания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторДниПовторения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторИнтервал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторПериодичность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Повторять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСобытийПланировщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтороннееСобытие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦветоваяГаммаПланировщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/СобытияПланировщика/Forms/НастройкаПовторения/Ext/Form/Module.bsl
#Область УправлениеФормой

&НаКлиенте
Процедура УстановитьВидимость()
	ВидимостьИнтервал = (ПовторПериодичность = 1 ИЛИ (ПовторПериодичность >= 5 И ПовторПериодичность <= 7));
	
	Элементы.ПовторИнтервал.Видимость	= ВидимостьИнтервал;
	
	Элементы.ГруппаДниНедели.Видимость	= (ПовторПериодичность = 5);
	Элементы.ГруппаДниМесяца.Видимость	= (ПовторПериодичность = 6);
	
	Элементы.ПовторКоличество.ТолькоПросмотр	= (ПовторВидОкончания = 2);
	Элементы.ПовторОкончание.ТолькоПросмотр		= (ПовторВидОкончания = 1);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовки()
	Если ПовторПериодичность = 1 Тогда
		ТекстЗаголовок = "дн."
	ИначеЕсли ПовторПериодичность = 5 Тогда
		ТекстЗаголовок = "нед.";
	ИначеЕсли ПовторПериодичность = 6 Тогда
		ТекстЗаголовок = "мес.";
	ИначеЕсли ПовторПериодичность = 7 Тогда
		ТекстЗаголовок = "г.";
	Иначе 
		ТекстЗаголовок = "";
	КонецЕсли;
	
	Элементы.НадписьШагИнтервала.Заголовок = ТекстЗаголовок;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПовторПериодичностьПриИзменении(Элемент)
	Если ПовторПериодичность >= 2 И ПовторПериодичность <= 4 Тогда
		ПовторИнтервал		= 0;
		ПовторДниПовторения = "";
	ИначеЕсли ПовторПериодичность = 6 Тогда
		ДеньМесяцаДеньНедели = 1;
	КонецЕсли;
	
	УстановитьВидимость();
	УстановитьЗаголовки();
	ОбновитьПредставлениеПовторения();
КонецПроцедуры

&НаКлиенте
Процедура ПовторИнтервалПриИзменении(Элемент)
	ОбновитьПредставлениеПовторения();
КонецПроцедуры

&НаКлиенте
Процедура ПовторИнтервалНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если ПовторПериодичность = 1 Тогда
		Начало	= 1;
		Конец	= 30;
	ИначеЕсли ПовторПериодичность = 5 Тогда
		Начало	= 1;
		Конец	= 30;
	ИначеЕсли ПовторПериодичность = 6 Тогда
		Начало	= 1;
		Конец	= 12;
	ИначеЕсли ПовторПериодичность = 7 Тогда
		Начало	= 1;
		Конец	= 30;
	Иначе 
		Начало	= 0;
		Конец	= 0;
	КонецЕсли;
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Очистить();
	Для Индекс = Начало По Конец Цикл
		СписокВыбора.Добавить(Индекс);
	КонецЦикла;
	
	ДанныеВыбора = СписокВыбора;
	
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПовторИнтервалОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ОбновитьПредставлениеПовторения();
КонецПроцедуры

&НаКлиенте
Процедура ПовторДниНеделиПриИзменении(Элемент)
	ОбновитьПредставлениеПовторения();
КонецПроцедуры

&НаКлиенте
Процедура ПовторДниМесяцаПриИзменении(Элемент)
	ОбновитьПредставлениеПовторения();
КонецПроцедуры

&НаКлиенте
Процедура ПовторНачалоПриИзменении(Элемент)
	УстановитьВидимость();
	ОбновитьПредставлениеПовторения();
КонецПроцедуры

&НаКлиенте
Процедура ПовторВидОкончанияПриИзменении(Элемент)
	Если ПовторВидОкончания = 0 Тогда
		ПовторОкончание		= Дата(1, 1, 1);
		ПовторКоличество	= 0;
	ИначеЕсли ПовторВидОкончания = 1 Тогда
		ПовторОкончание = Дата(1, 1, 1);
	ИначеЕсли ПовторВидОкончания = 2 Тогда
		ПовторКоличество = 0;
	КонецЕсли;
	
	УстановитьВидимость();
	ОбновитьПредставлениеПовторения();
КонецПроцедуры

&НаКлиенте
Процедура ПовторКоличествоПриИзменении(Элемент)
	ОбновитьПредставлениеПовторения();
КонецПроцедуры

&НаКлиенте
Процедура ПовторОкончаниеПриИзменении(Элемент)
	ОбновитьПредставлениеПовторения();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Параметры.Свойство("Объект") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,
		Параметры.Объект,
		"ПовторПредставление, ПовторВидОкончания, ПовторДниПовторения, ПовторИнтервал, ПовторКоличество, ПовторНачало,
		|ПовторОкончание, ПовторПериодичность, НачалоСобытия, ОкончаниеСобытия");
	
	Если Параметры.ТолькоПросмотр Тогда
		ЭтотОбъект.ТолькоПросмотр = Истина;
		Элементы.ФормаГотово.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ПовторПериодичность = 5 Тогда
		Соответствие = Новый Соответствие;
		Соответствие.Вставить("1","пн");
		Соответствие.Вставить("2","вт");
		Соответствие.Вставить("3","ср");
		Соответствие.Вставить("4","чт");
		Соответствие.Вставить("5","пт");
		Соответствие.Вставить("6","сб");
		Соответствие.Вставить("7","вс");
	ИначеЕсли ПовторПериодичность = 6 Тогда
		Соответствие = Новый Соответствие;
		Соответствие.Вставить("1", 1);
		Соответствие.Вставить("2", 2);
	Иначе 
		Соответствие = Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Соответствие) = Тип("Соответствие") Тогда
		Массив = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПовторДниПовторения, ",");
		
		Для Каждого ЗначениеСтроки Из Массив Цикл
			ИмяРеквизита		= ?(ПовторПериодичность = 6, "ДеньМесяцаДеньНедели", Соответствие.Получить(ЗначениеСтроки));
			ЗначениеРеквизита	= ?(ПовторПериодичность = 6, Соответствие.Получить(ЗначениеСтроки), Истина);
			
			ЭтотОбъект[ИмяРеквизита] = ЗначениеРеквизита;
		КонецЦикла;
	КонецЕсли;
	
	УстановитьВидимость();
	УстановитьЗаголовки();
	ОбновитьПредставлениеПовторения();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	Если НЕ ЭтотОбъект.Модифицированность Тогда
		Отмена(Команда);
		Возврат;
	КонецЕсли;
	
	// Дни повторения
	ПовторДниПовторения = "";
	Если ПовторПериодичность = 5 Тогда
		Структура = Новый Структура("пн, вт, ср, чт, пт, сб, вс", "1", "2", "3", "4", "5", "6", "7");
		Для Каждого КлючИЗначение Из Структура Цикл
			Ключ		= КлючИЗначение.Ключ;
			Значение	= КлючИЗначение.Значение;
			Если НЕ ЭтотОбъект[Ключ] Тогда
				Продолжить;
			КонецЕсли;
			
			ПовторДниПовторения = ПовторДниПовторения + ?(ПустаяСтрока(ПовторДниПовторения), "", ",") + Значение;
		КонецЦикла;
	ИначеЕсли ПовторПериодичность = 6 Тогда
		ПовторДниПовторения = Строка(ЭтотОбъект.ДеньМесяцаДеньНедели);
	КонецЕсли;
	
	Структура = Новый Структура("ПовторПредставление, ПовторПериодичность, ПовторНачало, ПовторОкончание, ПовторИнтервал, ПовторКоличество, ПовторВидОкончания, ПовторДниПовторения, НачалоСобытия, ОкончаниеСобытия");
	
	Если НачалоДня(ПовторНачало) <> НачалоДня(НачалоСобытия) Тогда
		Разница = ОкончаниеСобытия - НачалоСобытия;
		
		НачалоСобытия		= НачалоДня(ПовторНачало) + (НачалоСобытия - НачалоДня(НачалоСобытия));
		ОкончаниеСобытия	= НачалоСобытия + Разница;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Структура, ЭтотОбъект);
	ЭтотОбъект.Закрыть(Структура);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтотОбъект.Закрыть(Неопределено);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьПредставлениеПовторения()
	// Дни повторения
	ПовторДниПовторения = "";
	Если ПовторПериодичность = 5 Тогда
		Структура = Новый Структура("пн, вт, ср, чт, пт, сб, вс", "1", "2", "3", "4", "5", "6", "7");
		Для Каждого КлючИЗначение Из Структура Цикл
			Ключ		= КлючИЗначение.Ключ;
			Значение	= КлючИЗначение.Значение;
			Если НЕ ЭтотОбъект[Ключ] Тогда
				Продолжить;
			КонецЕсли;
			
			ПовторДниПовторения = ПовторДниПовторения + ?(ПустаяСтрока(ПовторДниПовторения), "", ",") + Значение;
		КонецЦикла;
	ИначеЕсли ПовторПериодичность = 6 Тогда
		ПовторДниПовторения = Строка(ЭтотОбъект.ДеньМесяцаДеньНедели);
	КонецЕсли;
	
	СтруктураПовтор = ПланировщикДанныеКлиентСервер.ПолучитьСтруктуруПовторения();
	ЗаполнитьЗначенияСвойств(СтруктураПовтор, ЭтотОбъект);
	ПовторПредставление = ПланировщикДанныеКлиентСервер.ПолучитьПредставлениеПовторения(СтруктураПовтор);
КонецПроцедуры

#КонецОбласти
